; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v3 - type_1 ?v5 - type_2)
 	      (pred_3 ?v1 - object ?v5 - type_2)
	      (pred_1 ?v3 - type_1 ?v2 - type_3)
	      (pred_2 ?v3 - type_1 ?v1 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v3 - type_1 ?v4 ?v6 - type_2)
       :precondition (and  (pred_4 ?v3 ?v4))
       :effect (and  (pred_4 ?v3 ?v6)
		     (not (pred_4 ?v3 ?v4))))

   (:action op_2
       :parameters (?v3 - type_1 ?v7 - object ?v8 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v8) (pred_4 ?v3 ?v8) (pred_1 ?v3 ?v2))
       :effect (and (pred_2 ?v3 ?v7 ?v2)
		    (not (pred_3 ?v7 ?v8)) 
		    (not (pred_1 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_1 ?v7 - object ?v8 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v3 ?v7 ?v2) (pred_4 ?v3 ?v8))
       :effect (and (pred_3 ?v7 ?v8)
		    (pred_1 ?v3 ?v2)
		    (not (pred_2 ?v3 ?v7 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_09 - type_1
obj_03 obj_08 obj_04 obj_02 - type_3
obj_12 obj_10 obj_06 obj_13 - type_2
obj_14 obj_07 obj_05 obj_01 - object)
(:init
(pred_4 obj_11 obj_10)
(pred_1 obj_11 obj_03)
(pred_1 obj_11 obj_08)
(pred_4 obj_09 obj_12)
(pred_1 obj_09 obj_04)
(pred_1 obj_09 obj_02)
(pred_3 obj_14 obj_12)
(pred_3 obj_07 obj_13)
(pred_3 obj_05 obj_10)
(pred_3 obj_01 obj_13)
)
(:goal
(and
(pred_3 obj_14 obj_10)
(pred_3 obj_07 obj_06)
(pred_3 obj_05 obj_13)
(pred_3 obj_01 obj_06)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_06)))
)
)

; plan
1. (op_2 obj_09 obj_14 obj_12 obj_02)
   deleted: (pred_3 obj_14 obj_12) (pred_1 obj_09 obj_02)
   added: (pred_2 obj_09 obj_14 obj_02)
   goals met: 0 of 4
2. (op_2 obj_11 obj_05 obj_10 obj_08)
   deleted: (pred_3 obj_05 obj_10) (pred_1 obj_11 obj_08)
   added: (pred_2 obj_11 obj_05 obj_08)
   goals met: 0 of 4
3. (op_1 obj_09 obj_12 obj_10)
   deleted: (pred_4 obj_09 obj_12)
   added: (pred_4 obj_09 obj_10)
   goals met: 0 of 4
4. (op_1 obj_11 obj_10 obj_13)
   deleted: (pred_4 obj_11 obj_10)
   added: (pred_4 obj_11 obj_13)
   goals met: 0 of 4
5. (op_3 obj_11 obj_05 obj_13 obj_08)
   deleted: (pred_2 obj_11 obj_05 obj_08)
   added: (pred_3 obj_05 obj_13) (pred_1 obj_11 obj_08)
   goals met: 1 of 4
6. (op_3 obj_09 obj_14 obj_10 obj_02)
   deleted: (pred_2 obj_09 obj_14 obj_02)
   added: (pred_3 obj_14 obj_10) (pred_1 obj_09 obj_02)
   goals met: 2 of 4
7. (op_2 obj_11 obj_01 obj_13 obj_03)
   deleted: (pred_3 obj_01 obj_13) (pred_1 obj_11 obj_03)
   added: (pred_2 obj_11 obj_01 obj_03)
   goals met: 2 of 4
8. (op_1 obj_09 obj_10 obj_13)
   deleted: (pred_4 obj_09 obj_10)
   added: (pred_4 obj_09 obj_13)
   goals met: 2 of 4
9. (op_3 obj_11 obj_01 obj_13 obj_03)
   deleted: (pred_2 obj_11 obj_01 obj_03)
   added: (pred_3 obj_01 obj_13) (pred_1 obj_11 obj_03)
   goals met: 2 of 4
10. (op_2 obj_09 obj_07 obj_13 obj_02)
   deleted: (pred_3 obj_07 obj_13) (pred_1 obj_09 obj_02)
   added: (pred_2 obj_09 obj_07 obj_02)
   goals met: 2 of 4
11. (op_1 obj_09 obj_13 obj_06)
   deleted: (pred_4 obj_09 obj_13)
   added: (pred_4 obj_09 obj_06)
   goals met: 2 of 4
12. (op_3 obj_09 obj_07 obj_06 obj_02)
   deleted: (pred_2 obj_09 obj_07 obj_02)
   added: (pred_3 obj_07 obj_06) (pred_1 obj_09 obj_02)
   goals met: 3 of 4
13. (op_1 obj_09 obj_06 obj_13)
   deleted: (pred_4 obj_09 obj_06)
   added: (pred_4 obj_09 obj_13)
   goals met: 3 of 4
14. (op_2 obj_09 obj_01 obj_13 obj_02)
   deleted: (pred_3 obj_01 obj_13) (pred_1 obj_09 obj_02)
   added: (pred_2 obj_09 obj_01 obj_02)
   goals met: 3 of 4
15. (op_1 obj_09 obj_13 obj_06)
   deleted: (pred_4 obj_09 obj_13)
   added: (pred_4 obj_09 obj_06)
   goals met: 3 of 4
16. (op_3 obj_09 obj_01 obj_06 obj_02)
   deleted: (pred_2 obj_09 obj_01 obj_02)
   added: (pred_3 obj_01 obj_06) (pred_1 obj_09 obj_02)
   goals met: 4 of 4
